hours = {
    0:  ["двенадцать", "первого", "час"],
    1:  ["один", "второго", "два"],
    2:  ["два", "третьего", "три"],
    3:  ["три", "четвертого", "четыре"],
    4:  ["четыре", "пятого", "пять"],
    5:  ["пять", "шестого", "шесть"],
    6:  ["шесть", "седьмого", "семь"],
    7:  ["семь", "восьмого", "восемь"],
    8:  ["восемь", "девятого", "девять"],
    8:  ["девять", "десятого", "десять"],
    10: ["десять", "одиннадцатого", "одинадцать"],
    11: ["одиннадцать", "двенадцатого", "двенадцать"],
    12: ["двенадцать", "первого", "час"],
}

minutes = {
    0:  ["ровно"],
    1:  ["одна минута"],
    2:  ["две минуты"],
    3:  ["три минуты"],
    4:  ["четыре минуты"],
    5:  ["пять минут"],
    6:  ["шесть минут"],
    7:  ["семь минут"],
    8:  ["восемь минут"],
    9:  ["девять минут"],
    10: ["десять минут"],
    11: ["одиннадцать минут"],
    12: ["двенадцать минут"],
    13: ["тринадцать минут"],
    14: ["четырнадцать минут"],
    15: ["пятнадцать минут"],
    16: ["шестнадцать минут"],
    17: ["семнадцать минут"],
    18: ["восемнадцать минут"],
    19: ["девятнадцать минут"],
    20: ["двадцать минут"],
    21: ["двадцать одна минута"],
    22: ["двадцать две минуты"],
    23: ["двадцать три минуты"],
    24: ["двадцать четыре минуты"],
    25: ["двадцать пять минут"],
    26: ["двадцать шесть минут"],
    27: ["двадцать семь минут"],
    28: ["двадцать восемь минут"],
    29: ["двадцать девять минут"],
    30: ["половина"],
    31: ["тридцать одна минута"],
    32: ["тридцать две минуты"],
    33: ["тридцать три минуты"],
    34: ["тридцать четыре минуты"],
    35: ["тридцать пять минут"],
    36: ["тридцать шесть минут"],
    37: ["тридцать семь минут"],
    38: ["тридцать восемь минут"],
    39: ["тридцать девять минут"],
    40: ["сорок минут"],
    41: ["сорок одна минута"],
    42: ["сорок две минуты"],
    43: ["сорок три минуты"],
    44: ["сорок четыре минуты"],
    45: ["без пятнадцати"],
    46: ["без четырнадцати минут"],
    47: ["без тринадцати минут"],
    48: ["без двенадцати минут"],
    49: ["без одинадцати минут"],
    50: ["без десяти"],
    51: ["без девяти минут"],
    52: ["без восьми минут"],
    53: ["без семи минут"],
    54: ["без шести минут"],
    55: ["без пяти"],
    56: ["без четырех минут"],
    57: ["без трех минут"],
    58: ["без двух минут"],
    59: ["без одной минуты"]
}

time_1 = input("Enter the time in 'hh:mm'")
time_2 = time_1.split(":")
time_hh = int(time_2[0])
time_mm = int(time_2[1])
a=len(str(time_hh))
b=len(str(time_mm))
print(f" {'' if (24 > time_hh > 0 and 60 > time_mm > 0) else 'Error! There are 24 hours in a day and 60 minuts in a hour'}")
print(f" {'The input of time is succesful' if ( a == 2 and b == 2) else 'Error! You should enter hh:mm'}")
#switch to 12 hour format
if time_hh > 12:
    time_hh = (time_hh-12)
    #print(time_hh, time_mm)
wtime_hh = hours.get(time_hh)
wtime_mm = minutes.get(time_mm)

# вводим окончания "час", "часа", "часов"
if time_hh == 1:
    fin = "час"
elif time_hh in range(2, 4):
    fin = "часа"
else:
    fin = "часов"
wtime = f" {wtime_hh [0]} {fin} ровно"

if time_mm == 30:
    wtime = f"{wtime_mm [0]} {wtime_hh [1]}"
    print(wtime)
if 0 < time_mm < 30 or 30 < time_mm < 45:
    wtime = f"{wtime_mm [0]} {wtime_hh [1]}"
    print(wtime)
if 60 < time_mm > 44:
    wtime = f"{wtime_mm [0]} {wtime_hh [2]}"
    print(wtime)

